**Note:-** 

* MySQL is a widely used relational database management system (RDBMS).


* MySQL is free and open-source.


* MySQL is ideal for both small and large applications.

### Q) What is MySQL?

* MySQL is a relational database management system


* MySQL is open-source


* MySQL is free


* MySQL is ideal for both small and large applications


* MySQL is very fast, reliable, scalable, and easy to use


* MySQL is cross-platform


* MySQL is compliant with the ANSI SQL standard


* MySQL was first released in 1995


* MySQL is developed, distributed, and supported by Oracle Corporation


* MySQL is named after co-founder Monty Widenius's daughter: My

### Q) What is RDBMS?

* RDBMS stands for Relational Database Management System.


* RDBMS is a program used to maintain a relational database.


* RDBMS is the basis for all modern database systems such as MySQL, Microsoft SQL Server, Oracle, and Microsoft Access.


* RDBMS uses SQL queries to access the data in the database.

### Q) What is SQL?
SQL stands for Structured Query Language. It is a standard language which is used to deal with databases. We can manipulate and fetch data from databases using SQL.

### Semicolon after SQL Statements?
* Some database systems require a semicolon at the end of each SQL statement.


* Semicolon is the standard way to separate each SQL statement in database systems that allow more than one SQL statement to be executed in the same call to the server.

### Some of The Most Important SQL Commands
`SELECT` - extracts data from a database

`UPDATE` - updates data in a database

`DELETE` - deletes data from a database

`INSERT INTO` - inserts new data into a database

`CREATE DATABASE` - creates a new database

`ALTER DATABASE` - modifies a database

`CREATE TABLE` - creates a new table

`ALTER TABLE` - modifies a table

`DROP TABLE` - deletes a table

`CREATE INDEX` - creates an index (search key)

`DROP INDEX` - deletes an index

### Some common Syntax Keywords used in ascending order to write a query

`SELECT`

`FROM`

`WHERE`

`GROUPBY`

`HAVING`

`ORDERBY`

**Note:-**

* SQL keywords are NOT case sensitive: `select` is the same as `SELECT`

    
* Always write a categories of column in `strings`, i.e ('Category 1', 'Category 2'...)


* If categories of column are in `interger`, then write it simple, i.e (1,2,3...)

### 1) `SELECT` Statement

The `SELECT` statement is used to select data from a database.

The data returned is stored in a result table, called the result-set.

`SELECT` Syntax

**`SELECT` column1, column2,... FROM table_name;**

**OR**

***`SELECT` * FROM table_name;**

### 2) `SELECT DISTINCT` 

DISTINCT keyword is used to see and fetch the unique values of a column in a table.


**SELECT `DISTINCT` Country FROM Customers;**

**OR**

**SELECT `DISTINT` Country,City FROM Customers;**

i.e: Country and CIty are columns and Customers is a Table.

### 3) `COUNT (DISTINCT Column Name)`

`COUNT (DISTINCT Column Name)` is used to see the count of unique value present in a column.

**SELECT COUNT(DISTINCT Country) FROM Customers;**

### 4) `Aliases`

* `Aliases` are used to give a table, or a column in a table, a temporary name.


* `Aliases` are often used to make column names more readable.


* An `alias` only exists for the duration of that query.


* An `alias` is created with the `AS` keyword.

**SELECT column_name `AS` alias_name
FROM table_name;**

**SELECT column_name(s)
FROM table_name `AS` alias_name;**

**SELECT CustomerID `AS` ID, CustomerName `AS` Customer
FROM Customers;**

**SELECT Country `AS` CNT FROM Customers;**

**SELECT `COUNT(DISTINCT Country)` `AS` abc FROM Customers;**

### 5) `ORDER BY`

* `Order By` keyword is used to sort the values of a column in ascending order.


* The `ORDER BY` keyword is used to sort the result-set in ascending or descending order.


* The `ORDER BY` keyword sorts the records in ascending order by default. To sort the records in descending order, use the `DESC` keyword.

**SELECT column1, column2, ... FROM table_name `ORDER BY` column1, column2, ... ASC|DESC;**

**SELECT DISTINCT Country FROM Customers `ORDER BY` Country;**

***SELECT * FROM Customers `ORDER BY` Country `ASC`, City `DESC`**

### 6) Use `ORDER BY` with `Asc` & `Desc`

* `ORDER BY` Column Name `Desc` keyword is used to sort the values of a column in descending order.

**SELECT DISTINCT Country FROM Customers `ORDER BY` Country `Desc`;**

***SELECT * FROM Customers `ORDER BY` Country `Asc`, `ORDER By` CustomerName `Desc`;**

### 7) `WHERE`

* The `WHERE` clause is used to filter records.


* It is used to extract only those records that fulfill a specified condition.


* The `WHERE` clause can be combined with `AND`, `OR`, and `NOT` operators.


* The `AND` and `OR` operators are used to filter records based on more than one condition:


|Operator|Description|	
|--------|-----------|
|=	|Equal|	
|>	|Greater than|	
|<	|Less than|	
|>=	|Greater than or equal|	
|<=	|Less than or equal|	
|<> / !=	|Not equal.|	
|BETWEEN	|Between a certain range|	
|LIKE	|Search for a pattern|	
|IN	|To specify multiple possible values for a column|

***SELECT * FROM Customers `WHERE` Country='GERMANY';**

***SELECT * FROM Customers WHERE CustomerID=1;**

### 8) Use of `WHERE` clause with `<>` (Not equal) symbol

`<>` (Not equal) symbol retrieve rows where the value doesn't match

***SELECT * FROM Customers `WHERE` City `<>` 'Germany';**

### 9) Use of `WHERE` clause with`>` (Greater Than) Symbol

`>` (Greater Than) symbol retrieve rows where the value is greater than the given value

***SELECT * FROM Customers `WHERE` CustomerID `>` 5;**

**OR**

***SELECT * FROM Customers  `WHERE`  CustomerID `>=` 5;**

### 10) Use of `WHERE` clause with `<` (Lesser Than) Symbol

`<` (Lesser Than) symbol retrieve rows where the value is lesser than the given value

***SELECT * FROM Customers `WHERE` CustomerID `<` 5;**

**OR**

***SELECT * FROM Customers `WHERE` CustomerID `<=` 5;**

### 11) Use of `WHERE` clause with `And` Operator

* The `AND` operator is used to specify that all conditions must be true for a row.


* The `AND` operator displays a record if all the conditions separated by `AND` are TRUE.

**SELECT column1, column2, ... FROM table_name `WHERE` condition1 `AND` condition2 `AND` condition3 ...;**

***SELECT * FROM Customers `WHERE` Country='UK' `and` City='London';**

### 12) Use of `WHERE` clause with `OR` Operator

* The `OR` operator is used to specify that at least one of the conditions must be true.


* The `OR` operator displays a record if any of the conditions separated by `OR` is TRUE.

**SELECT column1, column2, ... FROM table_name `WHERE` condition1 `OR` condition2 `OR` condition3 ...;**

***SELECT * FROM Customers `WHERE` Country='UK' `or` Country='Germany';**

### 13) Use of `WHERE` clause with `NOT` Operator

The `NOT` operator displays a record if the condition(s) is NOT TRUE.

**SELECT column1, column2, ... FROM table_name WHERE NOT condition;**

***SELECT * FROM Customers WHERE NOT Country = 'Germany';**

### 14) Combining `AND`, `OR` and `NOT`  with `WHERE` Clause


***SELECT * FROM Customers WHERE Country = 'Germany' `AND` (City = 'Berlin'  OR` City = 'Stuttgart');**

***SELECT * FROM Customers `WHERE` `NOT` Country = 'Germany' `AND` `NOT` Country = 'USA';**

### 15) Use of `WHERE`  clause with  `IN` Operator

* The `IN` operator is used to display rows where the condition match.


* The `IN` operator allows you to specify multiple values in a `WHERE` clause.


* The `IN` operator is a shorthand for multiple OR conditions.

**SELECT column_name(s) FROM table_name `WHERE` column_name `IN` (value1, value2, ...);**

**SELECT column_name(s) FROM table_name `WHERE` column_name `IN` (SELECT STATEMENT);**

***SELECT * FROM Customers `Where` Country `IN` ('Germany','UK');**

***SELECT * FROM Customers `Where` CutomerID `IN` (1,2,3,4);**

***SELECT * FROM Customers
`WHERE` Country `IN` (SELECT Country FROM Suppliers);**

Show records of all Countries in Customers Table which present in Country column of Suppliers Table.

**Note:-** Inner query is always run first then outer query.

### 16) Use of `WHERE` clause with `NOT IN` Operator

The `NOT IN` operator is used to retrieve rows where the value of a column does not match

***SELECT * FROM Customers `WHERE` CustomerID `NOT IN` (1,2,3,4);**

### 17) Use of `Where` clause with `BETWEEEN` Operator

`Between` Operater is used to display recores Between a certain range.


The `BETWEEN` operator selects values within a given range. The values can be numbers, text, or dates.


The  BETWEEN` operator is inclusive: begin and end values are included.

**SELECT column_name(s)
FROM table_name
`WHERE` column_name `BETWEEN` value1 AND value2;**

***SELECT * FROM Customers `WHERE` CustomerID `BETWEEN` 20 `AND` 30;**

***SELECT * FROM Customers `WHERE` CustomerID `BETWEEN` 20 `AND` 30 `ORDER BY` Country;**

***SELECT * FROM Products
`WHERE` Price `NOT BETWEEN` 10 AND 20;**

***SELECT * FROM Products
`WHERE` Price `BETWEEN` 10 AND 20
`AND` CategoryID `NOT IN` (1,2,3);**

***SELECT * FROM Products
`WHERE` ProductName `BETWEEN` 'Carnarvon Tigers' `AND` 'Mozzarella di Giovanni'
`ORDER BY` ProductName;**

***SELECT * FROM Products
`WHERE` ProductName `NOT BETWEEN` 'Carnarvon Tigers' `AND` 'Mozzarella di Giovanni'
`ORDER BY` ProductName;**

***SELECT * FROM Orders
`WHERE` OrderDate `BETWEEN` '1996-07-01' `AND` '1996-07-31';**

### 18) Use of `Where` clause with `LIKE` Operator

The `LIKE` operator is used in a `WHERE` clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

The percent sign (%) represents zero, one, or multiple characters

The underscore sign (_) represents one, single character

The percent sign and the underscore can also be used in combinations!

|LIKE Operator|	Description|
|-------------|------------|
|WHERE CustomerName LIKE 'a%'	|Finds any values that start with "a"|
|WHERE CustomerName LIKE '%a'	|Finds any values that end with "a"|
|WHERE CustomerName LIKE '%or%'	|Finds any values that have "or" in any position|
|WHERE CustomerName LIKE '_r%'	|Finds any values that have "r" in the second position|
|WHERE CustomerName LIKE 'a_%'	|Finds any values that start with "a" and are at least 2 characters in length|
|WHERE CustomerName LIKE 'a__%'	|Finds any values that start with "a" and are at least 3 characters in length|
|WHERE ContactName LIKE 'a%o'	|Finds any values that start with "a" and ends with "o"|

***SELECT * FROM Customers `WHERE` City `LIKE` 's%';**


Return all records where city name is starts with s

***SELECT * FROM Customers `WHERE` City `LIKE` 'A%o%';**

***SELECT * FROM Customers
`WHERE` City `LIKE` '_ondon';**

### 19 `INSERT INTO`

* It is possible to write the INSERT INTO statement in two ways:

1. Specify both the column names and the values to be inserted:


**`INSERT INTO` table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);**


**`INSERT INTO` Customers (CustomerName, City, Country)
VALUES ('Cardinal', 'Stavanger', 'Norway');**

2. If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:

**`INSERT INTO` table_name
VALUES (value1, value2, value3, ...);**


**`INSERT INTO` Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway');**

**Note:-** If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.

### 20) `IS NULL` Syntax

It is not possible to test for NULL values with comparison operators, such as =, <, or <>.

We will have to use the `IS NULL` and `IS NOT NULL` operators instead.

**SELECT column_names FROM table_name `WHERE` column_name `IS NULL`;**

**SELECT CustomerName, ContactName, Address FROM Customers `WHERE` Address `IS NULL`;**

**Tip:** Always use IS NULL to look for NULL values.

### 21) `IS NOT NULL` Operator

The `IS NOT NULL` operator is used to test for non-empty values (NOT NULL values).

**SELECT column_names FROM table_name `WHERE` column_name `IS NOT NULL`;**

**SELECT CustomerName, ContactName, Address FROM Customers `WHERE` Address `IS NOT NULL`;**

### 22) `UPDATE` Syntax

The `UPDATE` statement is used to modify the existing records in a table.

**`UPDATE` table_name `SET` column1 = value1, column2 = value2, ... `WHERE` condition;**

**`UPDATE` Customers `SET` ContactName = 'Alfred Schmidt', City = 'Frankfurt' `WHERE` CustomerID = 1;**

### 23) `UPDATE` Multiple Records

It is the `WHERE` clause that determines how many records will be updated.

**`UPDATE` Customers `SET` PostalCode = 00000 `WHERE` Country = 'Mexico';**

### Update Warning!

Be careful when updating records. If you omit the WHERE clause, ALL records will be updated!

**`UPDATE` Customers `SET` PostalCode = 00000;**

|PostalCode|
|----------|
|00000|
|00000|
|00000|
|00000|
|00000|

### 24) `DELETE` Syntax

The `DELETE` statement is used to delete existing records in a table.

**`DELETE` FROM table_name `WHERE` condition;**

**`DELETE` FROM Customers `WHERE` CustomerName='Alfreds Futterkiste';**

### Delete All Records
It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact:

### Q) 25 `LIMIT` Clause

The `LIMIT` clause is used to specify the number of records to return.

The `LIMIT` clause is useful on large tables with thousands of records. Returning a large number of records can impact performance.

**SELECT column_name(s)
FROM table_name
`WHERE` condition
`LIMIT` number;**

***SELECT * FROM Customers
`LIMIT` 3;**

***SELECT * FROM Customers
`WHERE` Country='Germany'
`LIMIT` 3;**

# Aggregate Functions

### 26) MIN()

The `MIN()` function returns the smallest value of the selected column.

**SELECT `MIN(column_name)`
FROM table_name
`WHERE` condition;**

**SELECT `MIN(Price)` `AS` SmallestPrice
FROM Products;**

### 27) MAX()

The `MAX()` function returns the largest value of the selected column.

**SELECT `MAX(column_name)`
FROM table_name
`WHERE` condition;**

**SELECT `MAX(Price)` `AS` LargestPrice
FROM Products;**

### 28)  COUNT()

The `COUNT()` function returns the number of rows that matches a specified criterion.

**SELECT `COUNT(column_name)`
FROM table_name
`WHERE` condition;**

**SELECT `COUNT(ProductID)` 
FROM Products;**

### 29) AVG()

The `AVG()` function returns the average value of a numeric column.

**SELECT `AVG(column_name)`
FROM table_name
`WHERE` condition;**

**SELECT `AVG(Price)`
FROM Products;**

### 30) SUM() 

The `SUM()` function returns the total sum of a numeric column.

**SELECT `SUM(column_name)` 
FROM table_name
`WHERE` condition;**

**SELECT `SUM(Quantity)`
FROM OrderDetails;**